# VerticalFlip Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..VerticalFlip Method
HostedSweep Class See Also
---
Flip the hosted sweep object along vertical line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void VerticalFlip()
```

Visual Basic
---
```text
Public Sub VerticalFlip
```

Visual C++
---
```text
public:
void VerticalFlip()
```

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace